Repository: Boudy2002/Graduation-project
Catalog: project2/mentora/lib/l10n/app_*.arb
Languages: ar

# prize_money_left_after_expenses
source: A man won £6,000 in a competition. When he went to collect his prize money, hotel and travel expenses came to £250. He also spent a further £500 on celebrating. How much of his prize money was left?
ar: فاز رجل بـ 6000£، وأنفق 250£ على السفر و500£ على الاحتفال. كم تبقى؟

# car_park_exit_time
source: Have a look at the prices for car parking shown below. Up to 1 hour is 90p, 1 to 2 hours is £1.50, 2 to 3 hours is £2.30. Your friend parks at 14:15. She only has £2 in cash. When will she have to leave the car park?
ar: أسعار الوقوف: حتى ساعة = 90 بنس، 1-2 ساعة = 1.50£، 2-3 ساعات = 2.30£. ركنت الساعة 14:15 ولديها 2£. متى يجب أن تغادر؟

# music_system_price_difference
source: A friend wants to buy a music system. There are two ways of paying: £399 cash or £95 deposit then payments totalling £350. What is the difference in price?
ar: سعر جهاز صوتي: 399£ نقدًا أو 95£ مقدمًا و350£ أقساط. ما الفرق في السعر؟

# ingredients_for_small_buns
source: The ingredients for 40 small buns include 400g butter and 160g of cherries. What amount of each would you need for 10 small buns?
ar: مكونات 40 كعكة صغيرة: 400غ زبدة و160غ كرز. كم تحتاج لـ 10 كعكات؟

source: Cm
ar: سم

source: Hours
ar: ساعات

source: M
ar: م

source: Metres
ar: أمتار

source: Minutes
ar: دقائق

# programs_30_mins_left
source: 9 programs, 30 mins left
ar: 9 برامج، متبقي 30 دقيقة

# programs_0_mins_left
source: 10 programs, 0 mins left
ar: 10 برامج، متبقي 0 دقيقة

# programs_40_mins_left
source: 8 programs, 40 mins left
ar: 8 برامج، متبقي 40 دقيقة

# programs_60_mins_left
source: 9 programs, 60 mins left
ar: 9 برامج، متبقي 60 دقيقة

source: By
ar: بواسطة

# butter_40g_cherries
source: 100g butter, 40g cherries
ar: 100 جم زبدة، 40 جم كرز

# butter_32g_cherries
source: 80g butter, 32g cherries
ar: 80 جم زبدة، 32 جم كرز

# butter_50g_cherries
source: 120g butter, 50g cherries
ar: 120 جم زبدة، 50 جم كرز

# butter_36g_cherries
source: 90g butter, 36g cherries
ar: 90 جم زبدة، 36 جم كرز

source: Congratulations !
ar: تهانينا!

source: Based on your selections you are:
ar: استنادًا إلى اختياراتك، أنت

# of_word
source: of
ar: من

source: Advanced Level
ar: مستوى متقدم

source: Mid Level
ar: مستوى متوسط

source: Low Level
ar: مستوى منخفض

source: You got
ar: لقد حصلت على

source: questions correct
ar: إجابات صحيحة

# your_score_higher_then
source: Your score is higher than
ar: نتيجتك أعلى من

source: of the people who have taken this test
ar: من الأشخاص الذين خضعوا لهذا الاختبار.

source: Level
ar: المستوى

source: Go to home
ar: اذهب إلى الصفحة الرئيسية

# continue_word
source: Continue
ar: استمر

source: Home
ar: الصفحة الرئيسية

source: Community
ar: المجتمع

source: Roadmap
ar: خريطة الطريق

source: Profile
ar: الملف الشخصي

source: Experience Points
ar: نقاط الخبرة

source: Badges
ar: شارات

source: Coins
ar: عملات

source: Courses enrolled
ar: الدورات المسجلة

source: FAQ
ar: الأسئلة الشائعة

source: Feedback
ar: ملاحظات

source: Chatbot
ar: الدردشة الآلية

source: Support Agent
ar: وكيل الدعم

source: Write a message
ar: اكتب رسالة

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Content
ar: المحتوى

source: Favorites
ar: المفضلة

source: Edit Profile
ar: تعديل الملف الشخصي

source: Theme
ar: السمة

source: Language
ar: اللغة

source: courses
ar: الدورات

source: Change Picture
ar: تغيير الصورة

source: Update your name
ar: تحديث اسمك

source: Update your email
ar: تحديث بريدك الإلكتروني

source: Update Profile
ar: تحديث الملف الشخصي
