Repository: Boudy2002/Graduation-project
Catalog: project2/mentora/lib/l10n/app_*.arb
Languages: ar

source: Enter Your Email
ar: أدخل بريدك الإلكتروني

source: Enter Your Password
ar: أدخل كلمة المرور

source: Confirm Your Password
ar: تأكيد كلمة المرور

source: Please Confirm Your Password
ar: يرجى تأكيد كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Forget Password
ar: نسيت كلمة المرور

source: Login
ar: تسجيل الدخول

source: Signup
ar: إنشاء حساب

source: Create Account
ar: إنشاء حساب

# dont_have_account
source: Don’t have an account?
ar: ليس لديك حساب؟

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Invalid Email
ar: بريد إلكتروني غير صالح

source: Invalid Password
ar: كلمة مرور غير صالحة

source: Start Your Learning Experience
ar: ابدأ تجربتك التعليمية

source: Or With
ar: أو بواسطة

source: Please enter Your Email
ar: يرجى إدخال بريدك الإلكتروني

source: Please Enter Your Password
ar: يرجى إدخال كلمة المرور

source: Hi, Welcome Back! 👋
ar: مرحباً، أهلاً بعودتك! 👋

source: Please Select Your Gender
ar: يرجى تحديد جنسك

source: Select Your Gender
ar: اختر جنسك

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Choose Your Role
ar: اختر وظيفتك

source: Please Choose Your Role
ar: يرجى اختيار الوظيفة

source: Choose Your Degree
ar: اختر درجتك العلمية

source: Please Choose Your Degree
ar: يرجى اختيار درجتك العلمية

source: Enter Your College
ar: أدخل اسم الكلية

source: Please Enter Your College
ar: يرجى إدخال اسم الكلية

source: Enter Your Name
ar: أدخل اسمك

source: Please Enter Your Name
ar: يرجى إدخال اسمك

source: Letters Only
ar: أحرف فقط

source: Start date
ar: تاريخ البدء

# end_date
source: Expected / End date
ar: تاريخ الانتهاء / المتوقع

source: Start
ar: ابدأ

source: Reset
ar: إعادة تعيين

source: Front End Developer
ar: مطوّر الواجهة الأمامية

source: Product Manager
ar: مدير منتج

source: Data Scientist
ar: عالم بيانات

source: Software Engineer
ar: مهندس برمجيات

source: Back end Developer
ar: مطوّر الواجهة الخلفية

source: Mobile Developer
ar: مطوّر تطبيقات الجوال

source: UX/UI Designer
ar: مصمم UX/UI

source: DevOps Engineer
ar: مهندس DevOps

source: QA Engineer
ar: مهندس ضمان الجودة

source: Full Stack Developer
ar: مطوّر متكامل

source: System Architect
ar: مهندس نظم

source: Technical Lead
ar: قائد تقني

source: Engineering Manager
ar: مدير هندسي

source: AI/ML Engineer
ar: مهندس AI/ML

source: Cloud Engineer
ar: مهندس سحابة

source: Student
ar: طالب

# bachelors_degree
source: Bachelor's Degree (BA, BS, BBA, etc.)
ar: درجة البكالوريوس (BA، BS، BBA، إلخ.)

# masters_degree
source: Master's Degree (MA, MS, MBA, etc.)
ar: درجة الماجستير (MA، MS، MBA، إلخ.)

# doctorate
source: Doctorate (Ph.D., EdD, etc.)
ar: درجة الدكتوراه (Ph.D.، EdD، إلخ.)

source: High School
ar: المرحلة الثانوية

source: Hi,
ar: مرحباً،

source: Welcome to our LXP
ar: مرحباً بك في منصتنا التعليمية

# onboarding_title1
source: Welcome to Mentora!
ar: مرحبًا بك في Mentora!

# onboarding1
source: Embark on a journey to discover new skills and achieve your goals with ease
ar: ابدأ رحلة لاكتساب مهارات جديدة وتحقيق أهدافك بسهولة

# onboarding_title2
source: Learning Tailored to You
ar: تعلم مصمم خصيصاً لك

# onboarding2
source: Get a customized learning experience designed to match your interests and career goals.
ar: احصل على تجربة تعلم مخصصة تناسب اهتماماتك وأهدافك المهنية.

# onboarding_title3
source: Interactive & Engaging
ar: تعلم تفاعلي وممتع

# onboarding3
source: Explore videos, quizzes, and challenges to make learning fun and effective.
ar: استكشف مقاطع الفيديو والاختبارات والتحديات لجعل التعلم ممتعاً وفعالاً.

# onboarding_title4
source: Join a Thriving Community
ar: انضم إلى مجتمع مزدهر

# onboarding4
source: Connect with a global community of learners, mentors, and experts.
ar: تواصل مع مجتمع عالمي من المتعلمين والمعلمين والخبراء.

# onboarding_title5
source: Ready for a Quick Quiz!
ar: هل أنت مستعد لاختبار سريع!

# onboarding5
source: Read each statement. If you agree with the statement, fill in the circle. There are no wrong answers! Let's see what you've got! Goodluck!
ar: اقرأ كل عبارة. إذا كنت توافق، قم بتحديد الدائرة. لا توجد إجابات خاطئة! هيا نرى ماذا لديك! حظاً موفقاً!

source: Back
ar: السابق

source: Next
ar: التالي

source: Done
ar: تم

source: Skills
ar: المهارات

source: Personality
ar: الشخصية

source: Let's test your knowledge
ar: هيا نختبر معرفتك

source: Start Quiz
ar: ابدأ الاختبار

source: Detail Quiz
ar: تفاصيل الاختبار

source: Get
ar: احصل على

source: Points
ar: نقاط

source: Brief explanation about this quiz
ar: شرح موجز حول هذا الاختبار

source: Questions
ar: أسئلة

source: points for a correct answer
ar: نقاط للإجابة الصحيحة

source: Total duration of the quiz
ar: المدة الإجمالية للاختبار

source: min
ar: دقيقة

source: win
ar: اربح

source: Star
ar: نجمة

source: Earn your first badge
ar: احصل على أول شارة لك

source: Please read the text below carefully so you can understand it
ar: يرجى قراءة النص أدناه بعناية حتى تتمكن من فهمه

# tap_to_select_answer
source: Tap on options to select the correct answer
ar: انقر لاختيار الإجابة الصحيحة

# tap_to_bookmark
source: Tap on the bookmark icon to save interesting questions
ar: انقر على أيقونة الإشارة المرجعية لحفظ الأسئلة المهمة

# click_submit_to_finish
source: Click submit if you are sure you want to complete all the quizzes
ar: انقر على إرسال إذا كنت متأكدًا من إنهاء جميع الاختبارات

source: Get Started
ar: ابدأ الآن

# risac_test
source: RIASEC TEST
ar: اختبار RIASEC

source: Big Five Assessment
ar: اختبار الخمسة الكبار

source: Critical Thinking Assessment
ar: اختبار التفكير النقدي

source: Problem Solving Assessment
ar: اختبار حل المشكلات

source: Agree
ar: أوافق

source: Don't Agree
ar: لا أوافق

source: Strongly agree
ar: أوافق بشدة

source: Slightly agree
ar: أوافق قليلاً

source: Neutral
ar: محايد

source: Slightly disagree
ar: أعارض قليلاً

source: Strongly Disagree
ar: أعارض بشدة

source: I like to work on cars
ar: أحب العمل على السيارات

source: I like to do puzzles
ar: أحب حل الألغاز

source: I am good at working independently
ar: أنا جيد في العمل بشكل مستقل

source: I like to work in teams
ar: أحب العمل ضمن فرق

source: I am an ambitious person, I set goals for myself
ar: أنا شخص طموح، أضع أهدافاً لنفسي

source: I like to organize things (files, desks/offices)
ar: أحب تنظيم الأشياء (الملفات، المكاتب، المكاتب الإدارية)

source: I like to build things
ar: أحب بناء الأشياء

source: I like to read about art and music
ar: أحب القراءة عن الفن والموسيقى

source: I like to have clear instructions to follow
ar: أحب الحصول على تعليمات واضحة لأتبعها

source: I like to try to influence or persuade people
ar: أحب محاولة التأثير على الناس أو إقناعهم

source: I like to do experiments
ar: أحب إجراء التجارب

source: I like to teach or train people
ar: أحب تعليم الناس أو تدريبهم

source: I like trying to help people solve their problems
ar: أحب محاولة مساعدة الناس في حل مشكلاتهم

source: I like to take care of animals
ar: أحب العناية بالحيوانات

source: I wouldn't mind working 8 hours per day in an office
ar: لا أمانع في العمل 8 ساعات يومياً في مكتب

source: I like selling things
ar: أحب بيع الأشياء

source: I enjoy creative writing
ar: أستمتع بالكتابة الإبداعية

source: I enjoy science
ar: أستمتع بالعلوم

source: I am quick to take on new responsibilities
ar: أتحمل المسؤوليات الجديدة بسرعة

source: I am interested in healing people
ar: أنا مهتم بمساعدة الناس على الشفاء

source: I enjoy trying to figure out how things work
ar: أستمتع بمحاولة معرفة كيفية عمل الأشياء

source: I like putting things together or assembling things
ar: أحب تجميع الأشياء أو تركيبها

source: I am a creative person
ar: أنا شخص مبدع

source: I Pay attention to details.
ar: أنتبه للتفاصيل

source: I like to do filing or typing
ar: أحب تنظيم الملفات أو الطباعة

source: I like to analyze things (problems/situations)
ar: أحب تحليل الأمور (المشكلات أو الحالات)

source: I like to play instruments or sing
ar: أحب عزف الآلات الموسيقية أو الغناء

source: I enjoy learning about other cultures
ar: أستمتع بالتعرف على ثقافات أخرى

source: I would like to start my own business
ar: أود أن أبدأ مشروعي التجاري الخاص

source: I like to cook
ar: أحب الطبخ

source: I like acting in plays
ar: أحب التمثيل في المسرحيات

source: I am a practical person
ar: أنا شخص عملي

source: I like working with numbers or charts
ar: أحب العمل بالأرقام أو المخططات

source: I like to get into discussions about issues
ar: أحب الدخول في مناقشات حول القضايا

source: I am good at keeping records of my work
ar: أنا جيد في حفظ سجلات عملي

source: I like to lead
ar: أحب القيادة

source: I like working outdoors
ar: أحب العمل في الهواء الطلق

source: I would like to work in an office
ar: أود العمل في مكتب

source: I'm good at math
ar: أنا جيد في الرياضيات

source: I like helping people
ar: أحب مساعدة الناس

source: I like to draw
ar: أحب الرسم

source: I like to give speeches
ar: أحب إلقاء الخطب

source: Realistic
ar: واقعي

source: Investigative
ar: تحليلي

source: Artistic
ar: فني

source: Social
ar: اجتماعي

source: Enterprising
ar: مبادر

source: I Am the life of the party.
ar: أنا روح الحفلة

source: I Feel little concern for others.
ar: لا أشعر بالكثير من التعاطف مع الآخرين

source: I Am always prepared.
ar: أنا دائماً مستعد

source: I Get stressed out easily.
ar: أتوتر بسهولة

source: I Have a rich vocabulary.
ar: لدي مفردات غنية

source: I Don't talk a lot.
ar: لا أتحدث كثيراً

source: I Am interested in people.
ar: أنا مهتم بالناس

source: I Leave my belongings around.
ar: أترك أغراضي مبعثرة

source: I Am relaxed most of the time.
ar: أنا مسترخي معظم الوقت

source: I Have difficulty understanding abstract ideas.
ar: أواجه صعوبة في فهم الأفكار المجردة

source: I Feel comfortable around people.
ar: أشعر بالراحة حول الناس

source: I Insult people.
ar: أهين الناس

source: I Worry about things.
ar: أقلق بشأن الأمور

source: I Have a vivid imagination.
ar: لدي خيال حي

source: I Keep in the background.
ar: أبقى في الخلفية

source: I Sympathize with others' feelings.
ar: أتعاطف مع مشاعر الآخرين

source: I Make a mess of things.
ar: أفشل في تنظيم الأمور

source: I Seldom feel blue.
ar: نادراً ما أشعر بالحزن

source: I Am not interested in abstract ideas.
ar: لست مهتماً بالأفكار المجردة

source: I Start conversations.
ar: أبدأ المحادثات

source: I Am not interested in other people's problems.
ar: لست مهتماً بمشاكل الآخرين

source: I Get chores done right away.
ar: أنجز المهام فوراً

source: I Am easily disturbed.
ar: أشعر بالانزعاج بسهولة

source: I Have excellent ideas.
ar: لدي أفكار ممتازة

source: I Have little to say.
ar: ليس لدي الكثير لأقوله

source: I Have a soft heart.
ar: لدي قلب طيب

source: I Often forget to put things back in their proper place.
ar: كثيراً ما أنسى إعادة الأشياء إلى أماكنها الصحيحة

source: I Get upset easily.
ar: أنزعج بسهولة

source: I Do not have a good imagination.
ar: ليس لدي خيال جيد

source: I Talk to a lot of different people at parties.
ar: أتحدث إلى العديد من الأشخاص في الحفلات

source: I Am not really interested in others.
ar: لست مهتماً فعلاً بالآخرين

source: I Like order.
ar: أحب النظام

source: I Change my mood a lot.
ar: مزاجي يتغير كثيراً

source: I Am quick to understand things.
ar: أفهم الأمور بسرعة

source: I Don't like to draw attention to myself.
ar: لا أحب جذب الانتباه إلى نفسي

source: I Take time out for others.
ar: أخصص وقتاً للآخرين

source: I Shirk my duties.
ar: أتقاعس عن أداء واجباتي

source: I Have frequent mood swings.
ar: لدي تقلبات مزاجية متكررة

source: I Use difficult words.
ar: أستخدم كلمات معقدة

source: I Don't mind being the center of attention.
ar: لا أمانع أن أكون مركز الانتباه

source: I Feel others' emotions.
ar: أشعر بمشاعر الآخرين

source: I Follow a schedule.
ar: أتبع جدولاً زمنياً

source: I Get irritated easily.
ar: أنزعج بسهولة

source: I Spend time reflecting on things.
ar: أقضي وقتاً في التفكير بالأمور

source: I Am quiet around strangers.
ar: أكون هادئاً حول الغرباء

source: I Make people feel at ease.
ar: أجعل الناس يشعرون بالراحة

source: I Am exacting in my work.
ar: أنا دقيق جداً في عملي

source: I Often feel blue.
ar: أشعر بالحزن كثيراً

source: I Am full of ideas.
ar: أنا مليء بالأفكار

source: Extroversion
ar: الانبساطية

source: Agreeableness
ar: الود

source: Conscientiousness
ar: الضمير الحي

source: Openness to Experience
ar: الانفتاح على التجربة

source: Neuroticism
ar: العُصاب

source: Do they have a 4th of July in England?
ar: هل لديهم الرابع من يوليو في إنجلترا؟

source: How many birthdays does the average man have?
ar: كم عدد أعياد الميلاد التي يمتلكها الرجل العادي؟

source: Some months have 31 days, how many have 28?
ar: بعض الأشهر بها 31 يومًا، كم عدد الأشهر التي بها 28؟

source: A woman gives a beggar 50 cents, the woman is the beggar's sister, but the beggar is not the woman's brother. How come?
ar: امرأة تعطي متسولاً 50 سنتًا. المرأة أخت المتسول، لكن المتسول ليس أخاها. كيف ذلك؟

source: Why can't a man living in the USA be buried in Canada?
ar: لماذا لا يمكن دفن رجل يعيش في الولايات المتحدة في كندا؟

source: How many outs are there in an inning?
ar: كم عدد الإخراجات في جولة واحدة؟

source: Is it legal for a man in California to marry his widow's sister?
ar: هل من القانوني لرجل في كاليفورنيا أن يتزوج أخت أرملته؟

source: Two women play five games of checkers. Each woman wins the same number of games. There are no ties. Explain this.
ar: امرأتان تلعبان خمس مباريات شطرنج، وكل منهما تفوز بنفس عدد المباريات، ولا توجد تعادلات. فسر ذلك.

source: Divide 30 by 1/2 and add 10. What is the answer?
ar: اقسم 30 على 1/2 وأضف 10. ما هي الإجابة؟

source: A man builds a house rectangular in shape. All sides have southern exposure. A bear walks by the house. What color is the bear? Why?
ar: رجل يبني منزلًا مستطيلاً وكل جوانبه تواجه الجنوب. يمر دب بجانب المنزل. ما لون الدب؟ ولماذا؟

source: There are 3 apples and you take away 2. How many do you have?
ar: يوجد 3 تفاحات وأخذت 2. كم عدد ما تملكه؟

source: I have two U.S. coins totaling 55 cents. One is not a nickel. What are the coins?
ar: معي عملتان أمريكيتان تساويان معًا 55 سنتًا. إحداهما ليست نيكل. ما هما؟

source: If you have only one match and you walked into a room where there was an oil burner, a kerosene lamp, and a wood-burning stove, what would you light first?
ar: إذا كان لديك عود ثقاب واحد فقط، ودخلت غرفة بها موقد زيت، ومصباح كيروسين، وموقد حطب، ما الذي ستشعله أولاً؟

source: How far can a forester run into the woods?
ar: ما مدى المسافة التي يمكن للحطاب أن يركضها داخل الغابة؟

source: What was the president's name in 1950?
ar: ما كان اسم الرئيس في عام 1950؟

source: A forester has 17 trees, and all but 9 die. How many are left?
ar: لدى الحطاب 17 شجرة، وماتت جميعها ما عدا 9. كم تبقى؟

source: How many 2-cent stamps are in a dozen?
ar: كم عدد الطوابع من فئة 2 سنت في دزينة؟

source: A 4 x 4 planting density per acre is twice as many trees as an 8 x 8 spacing.
ar: الكثافة الزراعية 4×4 في الفدان تعني ضعف عدد الأشجار مقارنة بتباعد 8×8.

source: Name the greatest of all inventors.
ar: سمِّ أعظم المخترعين على الإطلاق.

source: Are creative skill practice books for children for the enrichment of their creative thinking?
ar: هل كتب تدريب المهارات الإبداعية للأطفال تهدف إلى إثراء تفكيرهم الإبداعي؟

source: Yes
ar: نعم

source: No
ar: لا

source: Maybe
ar: ربما

source: I don't know
ar: لا أعرف

source: One
ar: واحد

source: Depends on his age
ar: يعتمد على عمره

source: Twelve
ar: اثنا عشر

source: All of them
ar: جميعها

source: Two
ar: اثنان

source: The beggar is her sister
ar: المتسولة أختها

source: It's a riddle
ar: إنها فزورة

source: The beggar is adopted
ar: المتسول متبنى

source: He is her cousin
ar: إنه ابن عمها

source: Because it's illegal
ar: لأنه غير قانوني

source: Because he's not Canadian
ar: لأنه ليس كنديًا

source: Because he's still alive
ar: لأنه لا يزال على قيد الحياة

# because_he_doesnt_want_to_be
source: Because he does’t want to be
ar: لأنه لا يريد ذلك

source: Only with permission
ar: فقط بإذن

source: Only if she agrees
ar: فقط إذا وافقت

source: They cheated
ar: لقد غشوا

source: They played with someone else
ar: لعبوا مع شخص آخر

source: They were’t playing each other
ar: لم يكونوا يلعبون ضد بعضهم

source: They played online
ar: لعبوا عبر الإنترنت

source: White, it's a polar bear
ar: أبيض، إنه دب قطبي

source: Black, it's in the forest
ar: أسود، لأنه في الغابة

source: Brown, it's common
ar: بني، لأنه شائع

source: Depends on the location
ar: يعتمد على الموقع

source: None
ar: لا شيء

# c_and_a_nickel
source: 50c and a nickel
ar: 50 سنت ونيكل

source: A half-dollar and a nickel
ar: نصف دولار ونيكل

source: A penny and a half-dollar
ar: بنس ونصف دولار

source: Two quarters and a nickel
ar: ربعين ونيكل

source: Lamp
ar: مصباح

source: Oil burner
ar: موقد زيت

source: Stove
ar: موقد

source: The match
ar: عود الثقاب

source: Halfway
ar: منتصف الطريق

source: Until he gets tired
ar: حتى يتعب

source: All the way
ar: كل الطريق

source: One mile
ar: ميل واحد

source: Biden
ar: بايدن

source: Bush
ar: بوش

source: Same as now
ar: نفس الاسم الآن

source: Obama
ar: أوباما

source: All
ar: الكل

# true_word
source: True
ar: صحيح

# false_word
source: False
ar: خطأ

source: Depends on species
ar: يعتمد على النوع

source: Only in tropical regions
ar: فقط في المناطق الاستوائية

source: Einstein
ar: آينشتاين

source: Edison
ar: إديسون

source: Imagination
ar: الخيال

source: Tesla
ar: تسلا

source: Depends on the child
ar: يعتمد على الطفل

source: Sometimes
ar: أحيانًا

# a_childs_jacket_spacing
source: A child’s jacket is being made. It will need 3 buttonholes all evenly spaced. The distance from the bottom of the jacket to the top buttonhole will be 12 cm. What will be the distance between each buttonhole if there is a 2 cm space at the bottom?
ar: يتم خياطة سترة لطفل. ستحتاج إلى 3 فتحات أزرار متباعدة بالتساوي. إذا كانت المسافة من الأسفل إلى الفتحة العلوية 12 سم، فما المسافة بين كل فتحة؟

# meal_time_until_meet
source: You are going out for a meal with a friend. The time is 5pm and you have to meet her at 8pm. How long is it until you need to meet her?
ar: أنت ذاهب لتناول وجبة مع صديق. الساعة الآن 5 مساءً ويجب أن تقابلها في 8 مساءً. كم تبقى من الوقت؟

# coach_people_wait
source: There are 27 people waiting for a coach. When the coach arrives it only has room for 15 people. How many people will have to wait for the next coach?
ar: يوجد 27 شخصًا ينتظرون حافلة، وعند وصولها بها 15 مقعدًا فقط. كم عدد الأشخاص الذين سيضطرون للانتظار؟

# shopping_skirt_and_top
source: At a shopping centre you buy a skirt which costs £17.00 and a top which costs £8. How much do you spend in total?
ar: اشتريت تنورة بـ 17£ وقميصًا بـ 8£. كم أنفقت؟

# swimming_pool_distance
source: A swimming pool is 10 metres in width. If you swim across and back twice, how far will you swim?
ar: عرض حوض السباحة 10 أمتار. إذا سبحته ذهابًا وإيابًا مرتين، كم تكون المسافة؟

# furniture_chairs_per_table
source: A furniture shop has had a delivery of tables and a delivery of chairs. There are 3 tables and 18 chairs. How many chairs should be matched with each table?
ar: وصل للمحل 3 طاولات و18 كرسيًا. كم كرسيًا لكل طاولة؟

# car_park_spaces_avail
source: A car park has spaces for 75 cars but 110 turn up on a Saturday morning. How many cars cannot get into the car park?
ar: موقف سيارات به 75 مكانًا، لكن 110 سيارة وصلت. كم سيارة لن تجد مكانًا؟

# fast_food_burger_and_tea
source: You go to a fast food outlet and order a burger at £2.80 and a tea at £1.20. How much do you pay?
ar: طلبت برجر بـ 2.80£ وشاي بـ 1.20£. كم تدفع؟

# gardener_fencing_required
source: A gardener needs three lengths of fencing for a garden. He needs 2 lengths measuring 10 metres and one length measuring 5 metres. How much does he need altogether?
ar: البستاني يحتاج قطعتين طول كل منهما 10م وقطعة 5م. كم المجموع؟

# tiles_needed_for_bathroom
source: You need 100 tiles to tile your bathroom wall. The tiles are sold in boxes of 5. How many boxes will you need to buy?
ar: تحتاج إلى 100 بلاطة لتغطية الحائط. تُباع في علب تحتوي كل منها على 5. كم علبة تحتاج؟

# flatmates_cost_split
source: 6 flatmates go to the supermarket. They decide to divide the cost up between them. If they pay £36 in total, how much will each flatmate have to pay?
ar: 6 أشخاص اشتروا بقيمة 36£. كم سيدفع كل منهم؟

# tree_growth_in_3_years
source: A tree is 3 metres tall and is growing 25 cm each year, how high will it be in 3 years?
ar: شجرة طولها 3 أمتار وتنمو 25 سم سنويًا. كم سيكون طولها بعد 3 سنوات؟

# fruit_cost_in_winter
source: The price of some fruit is 50% more expensive in winter than in summer. If strawberries cost £1.60 for a punnet in summer, how much would they cost in winter?
ar: سعر الفاكهة يزيد 50٪ في الشتاء. إذا كان ثمن الفراولة 1.60£ في الصيف، كم سيكون في الشتاء؟

# bus_travel_time
source: You are on a bus in slow-moving traffic. The average speed of the bus is 10 mph. How long will it take to travel 5 miles?
ar: تسير الحافلة بسرعة 10 ميل/ساعة. كم تحتاج للوصول لمسافة 5 أميال؟

# tiles_needed_for_wall
source: You need 100 tiles to cover a wall. The tiles are sold in boxes of 9. How many boxes will you need to buy?
ar: تحتاج إلى 100 بلاطة لتغطية الحائط. تُباع في علب بها 9 بلاطات. كم علبة تحتاج؟

# temperature_difference_london_oslo
source: The temperature in London is 5°C, while in Oslo it is -3°C. What is the difference in temperature?
ar: درجة الحرارة في لندن 5° مئوية، وفي أوسلو -3°. ما الفرق؟

# cyclist_total_miles_day
source: A cyclist goes 14 miles to work each morning and the same back in the evening. How many miles will the cyclist do to work and back each day?
ar: يذهب راكب الدراجة 14 ميلاً للعمل ويعود نفس المسافة. كم يقطع يوميًا؟

# dvd_space_for_recording
source: You have an 8-hour DVD and need to know how many 50-minute programmes you can record, and how much space will be left over.
ar: لديك قرص DVD مدته 8 ساعات. كم عدد البرامج ذات 50 دقيقة يمكن تسجيلها؟ وكم سيتبقى؟

# training_miles_per_day
source: Your friend is training for a 10-mile run. She aims to do training runs of 30 miles a week. If she trains for 5 days a week and runs the same distance each day, how many miles will she run each day?
ar: صديقتك تتدرب لسباق 10 أميال، وتستهدف 30 ميلًا أسبوعيًا. كم تجري يوميًا إذا تدربت 5 أيام؟

# club_trip_car_count
source: A club trip has been organised. If 4 people are travelling together in a car, how many cars will be needed for 25 people?
ar: إذا كان كل 4 أشخاص يركبون معًا، فكم سيارة تحتاج لنقل 25 شخصًا؟

# exercise_machine_installment
source: An exercise machine costs £120 by mail order. If it can be paid for in 12 equal instalments, what will be the amount of each instalment?
ar: جهاز تمرين ثمنه 120£ ويمكن دفعه على 12 دفعة. كم قيمة كل دفعة؟

# dvd_profit_per_sale
source: A shop buys DVDs for £5 each. It sells them at £11 each, or 3 for £24. How much profit would they make on selling 2 DVDs?
ar: المحل يشتري DVD بـ 5£ ويبيعه بـ 11£ أو 3 بـ 24£. ما الربح من بيع 2؟

# car_park_free_spaces
source: A car park has 1,000 spaces. When the car park is three-quarters full, how many spaces will still be free?
ar: موقف سيارات به 1000 مكان، وكان ممتلئًا بنسبة 75%. كم عدد الأماكن المتاحة؟

# cola_cost_per_litre
source: You pay £1.80 for a 2-litre bottle of cola. What is the cost per litre?
ar: دفعت 1.80£ لزجاجة 2 لتر. كم التكلفة للتر؟

# survey_swim_100m
source: In a survey of 600 people, 25% said they could swim less than 100 m. The remainder said that they could swim 100 m or further. How many people said they could swim 100 m or further?
ar: من بين 600 شخص، 25% فقط لا يستطيعون السباحة 100م. كم عدد الذين يستطيعون؟

# quiz_score_calculation
source: In a quiz, you score 5 for a correct answer and -2 for a wrong answer. What would be the score for 8 correct and 4 wrong?
ar: تحصل على 5 درجات للإجابة الصحيحة و -2 للخطأ. ما مجموع 8 صحيحة و4 خاطئة؟
